In [46]:
import pandas as pd

In [47]:
df= pd.read_csv("titles.csv")
df.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [48]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [64]:
df.shape

(215981, 2)

In [69]:
df.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [67]:
df.info

<bound method DataFrame.info of                           title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]>

In [68]:
df.title

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [49]:
print(titles_df.shape)

(215981, 2)

In [50]:
titles_df.sort_values(by=("year"), axis = 0, ascending=False).iloc[0:2]

                 title  year
199790  New in Village  2024
44198        Wild Runs  2024

In [51]:

df1 = df["title"]=="Hamlet"
df1
df2=df[df1]
df2.count()

title    19
year     19
dtype: int64

In [57]:

df3 = df["title"]=="Treasure Island"
df4 = df[df3]

df4.sort_values(by="year", ascending=False)

                  title  year
166675  Treasure Island  1999
190792  Treasure Island  1985
103646  Treasure Island  1973
104714  Treasure Island  1972
90175   Treasure Island  1950
192917  Treasure Island  1934
47769   Treasure Island  1920
191379  Treasure Island  1918

In [63]:

df5 = ((df["year"]> 1950) & (df["year"]< 1959))
df6 = df[df5]

df6.count()

title    9697
year     9697
dtype: int64